[
  {
    "quote": "The cleaner and nicer the program, the faster it's going to run. And if it doesn't, it'll be easy to make it fast.",
    "source": "Joshua Bloch"
  },
  {
    "quote": "On two occasions I have been asked, &#x2013; \"Pray, Mr. Babbage, if you put into the machine wrong figures, will the right answers come out?\" In one case a member of the Upper, and in the other a member of the Lower House put this question. I am not able rightly to apprehend the kind of confusion of ideas that could provoke such a question.",
    "source": "Charles Babbage"
  },
  {
    "quote": "Playing with pointers is like playing with fire. Fire is perhaps the most important tool known to man. Carefully used, fire brings enormous benefits; but when fire gets out of control, disaster strikes.",
    "source": "John Barnes"
  },
  {
    "quote": "The programmer, like the poet, works only slightly removed from pure thought-stuff. He builds his castles in the air, from air, creating by exertion of the imagination. Few media of creation are so flexible, so easy to polish and rework, so readily capable of realizing grand conceptual structures....<br>Yet the program construct, unlike the poet's words, is real in the sense that it moves and works, producing visible outputs separate from the construct itself. [&#x2026] The magic of myth and legend has come true in our time. One types the correct incantation on a keyboard, and a display screen comes to life, showing things that never were nor could be.",
    "source": "Fred Brooks"
  },
  {
    "quote": "Computer programs are the most intricate, delicately balanced and finely interwoven of all the products of human industry to date. They are machines with far more moving parts than any engine: the parts don't wear out, but they interact and rub up against one another in ways the programmers themselves cannot predict.",
    "source": "James Gleick"
  },
  {
    "quote": "Applications programming is a race between software engineers, who strive to produce idiot-proof programs, and the universe which strives to produce bigger idiots. So far the Universe is winning.",
    "source": "Rick Cook"
  },
  {
    "quote": "The effective exploitation of his powers of abstraction must be regarded as one of the most vital activities of a competent programmer.",
    "source": "Edsger W. Dijkstra"
  },
  {
    "quote": "Computers are man's attempt at designing a cat: it does whatever it wants, whenever it wants, and rarely ever at the right time.",
    "source": "EMCIC"
  },
  {
    "quote": "If you lie to the computer, it will get you.",
    "source": "Perry Farrar"
  },
  {
    "quote": "There is no programming language, no matter how structured, that will prevent programmers from making bad programs.",
    "source": "Larry Flon"
  },
  {
    "quote": "If I ask another professor what he teaches in the introductory programming course, whether he answers proudly \"Pascal\" or diffidently \"FORTRAN,\" I know that he is teaching a grammar, a set of semantic rules, and some finished algorithms, leaving the students to discover, on their own, some process of design.",
    "source": "Robert Floyd"
  },
  {
    "quote": "No matter how slick the demo is in rehearsal, when you do it in front of a live audience, the probability of a flawless presentation is inversely proportional to the number of people watching, raised to the power of the amount of money involved.",
    "source": "Mark Gibbs"
  },
  {
    "quote": "[This] reminds me of a quotation from somebody that, whenever he tried to explain the logical structure of a programming language to a programmer, it was like a cat trying to explain to a fish what it feels like to be wet.",
    "source": "Saul Gorn"
  },
  {
    "quote": "There are two ways of constructing a software design. One way is to make it so simple that there are obviously no deficiencies. And the other way is to make it so complicated that there are no obvious deficiencies.",
    "source": "C.A.R. Hoare"
  },
  {
    "quote": "To me programming is more than an important practical art. It is also a gigantic undertaking in the foundations of knowledge.",
    "source": "Grace Hopper, quoted in <em>Management and the Computer of the Future</em> (1962) by Sloan School of Management, p. 277"
  },
  {
    "quote": "Programming: when the ideas turn into the real things.",
    "source": "Maciej Kaczmarek"
  },
  {
    "quote": "Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves.",
    "source": "Alan Kay"
  },
  {
    "quote": "Premature optimization is the root of all evil.",
    "source": "Donald Knuth"
  },
  {
    "quote": "The most important thing in a programming language is the name. A language will not succeed without a good name. I have recently invented a very good name, and now I am looking for a suitable language.",
    "source": "Donald Knuth"
  },
  {
    "quote": "\"Present-day computers are designed primarily to solve preformulated problems or to process data according to predetermined procedures. The course of the computation may be conditional upon results obtained during the computation, but all the alternatives must be foreseen in advance. &#x2026 The requirement for preformulation or predetermination is sometimes no great disadvantage. It is often said that programming for a computing machine forces one to think clearly, that it disciplines the thought process. If the user can think his problem through in advance, symbiotic association with a computing machine is not necessary.",
    "source": "J. C. R. Licklider"
  },
  {
    "quote": "One in a million is next Tuesday.",
    "source": "Gordon Letwin"
  },
  {
    "quote": "He who hasn't hacked assembly language as a youth has no heart. He who does as an adult has no brain.",
    "source": "John Moore"
  },
  {
    "quote": "Languages shape the way we think, or don't.",
    "source": "Erik Naggum"
  },
  {
    "quote": "Computer programming is tremendous fun. Like music, it is a skill that derives from an unknown blend of innate talent and constant practice. Like drawing, it can be shaped to a variety of ends &#x2013; commercial, artistic, and pure entertainment. Programmers have a well-deserved reputation for working long hours, but are rarely credited with being driven by creative fevers. Programmers talk about software development on weekends, vacations, and over meals not because they lack imagination, but because their imagination reveals worlds that others cannot see.",
    "source": "Larry O'Brien and Bruce Eckel"
  },
  {
    "quote": "The best book on programming for the layman is <em>Alice in Wonderland</em>, but that's because it's the best book on anything for the layman.",
    "source": "Alan Perlis"
  },
  {
    "quote": "Computer Science is embarrassed by the computer.",
    "source": "Alan Perlis"
  },
  {
    "quote": "Prolonged contact with the computer turns mathematicians into clerks and vice versa.",
    "source": "Alan Perlis"
  },
  {
    "quote": "Structured Programming supports the law of the excluded muddle.",
    "source": "Alan Perlis"
  },
  {
    "quote": "There are two ways to write error-free programs; only the third one works.",
    "source": "Alan Perlis"
  },
  {
    "quote": "When someone says: \"I want a programming language in which I need only say what I wish done\", give him a lollipop.",
    "source": "Alan J. Perlis"
  },
  {
    "quote": "Software and cathedrals are much the same &#x2013; first we build them, then we pray.",
    "source": "Sam Redwine"
  },
  {
    "quote": "Why bother with subroutines when you can type fast?",
    "source": "Vaughn Rokosz"
  },
  {
    "quote": "A Netscape engineer who shan't be named once passed a pointer to JavaScript, stored it as a string and later passed it back to C, killing 30.",
    "source": "Blake Ros"
  },
  {
    "quote": "Real Programmers always confuse Christmas and Halloween because Oct31 == Dec25.",
    "source": "Andrew Rutherford"
  },
  {
    "quote": "Anyone even peripherally involved with computers agrees that object-oriented programming (OOP) is the wave of the future. Maybe one in 50 of them has actually tried to use OOP &#x2013; which has a lot to do with its popularity.",
    "source": "Steve Steinberg"
  },
  {
    "quote": "Don't get suckered in by the comments &#x2026 they can be terribly misleading.",
    "source": "Dave Storer"
  },
  {
    "quote": "The three chief virtues of a programmer are: Laziness, Impatience and Hubris.",
    "source": "Larry Wall"
  },
  {
    "quote": "One day my daughter came in, looked over my shoulder at some Perl 4 code, and said, \"What is that, swearing?\"",
    "source": "Larry Wall"
  },
  {
    "quote": "Weinberg's Second Law: If builders built buildings the way programmers wrote programs, then the first woodpecker that came along would destroy civilization.",
    "source": "Gerald Weinberg"
  },
  {
    "quote": "Asking for efficiency and adaptability in the same program is like asking for a beautiful and modest wife. Although beauty and modesty have been known to occur in the same woman, we'll probably have to settle for one or the other. At least that's better than nzeither.",
    "source": "Gerald M. Weinberg,"
  },
  {
    "quote": "The main activity of programming is not the origination of new independent programs, but in the integration, modification, and explanation of existing ones.",
    "source": "Terry Winograd"
  }
]
